In [17]:
import pandas as pd

In [4]:
#create 
data = {
    "Name" : ["a", "b" , "c"],
    "age" :[28 , 25 , 32]

}

df = pd.DataFrame(data)
df

  Name  age
0    a   28
1    b   25
2    c   32

In [10]:
#read
df = pd.read_csv("./data.csv")
df

    Name  Age  Salary
0  Hasan   32    1000
1    Ali   33   50000
2  Vahid   49     100
3   Rana   30   99999

In [12]:
df.head()

    Name  Age  Salary
0  Hasan   32    1000
1    Ali   33   50000
2  Vahid   49     100
3   Rana   30   99999

In [13]:
df.describe()

            Age       Salary
count   4.00000      4.00000
mean   36.00000  37774.75000
std     8.75595  47585.30253
min    30.00000    100.00000
25%    31.50000    775.00000
50%    32.50000  25500.00000
75%    37.00000  62499.75000
max    49.00000  99999.00000

In [14]:
df['Age']

0    32
1    33
2    49
3    30
Name: Age, dtype: int64

In [15]:
df.iloc[2, 1]

np.int64(49)

In [18]:
#filter

filtered_df = df[df["Salary"]>2000]
filtered_df

   Name  Age  Salary
1   Ali   33   50000
3  Rana   30   99999

In [23]:
#sort

df_sorted = df.sort_values("Salary", ascending = True )

df_sorted

    Name  Age  Salary
2  Vahid   49     100
0  Hasan   32    1000
1    Ali   33   50000
3   Rana   30   99999

In [32]:
#add a new column
len(df)
df["Test"] = [1, 2, 3, 4]
df

    Name  Age  Salary  Test
0  Hasan   32    1000     1
1    Ali   33   50000     2
2  Vahid   49     100     3
3   Rana   30   99999     4

In [34]:
df.drop("Test" , axis = 1 , inplace = True)
df

    Name  Age  Salary
0  Hasan   32    1000
1    Ali   33   50000
2  Vahid   49     100
3   Rana   30   99999

In [36]:

len(df)
df.loc[len(df )]={
   "Name":"Test",
   "Age" :30

}
df

    Name  Age   Salary
0  Hasan   32   1000.0
1    Ali   33  50000.0
2  Vahid   49    100.0
3   Rana   30  99999.0
4   Test   30      NaN
5   Test   30      NaN

In [37]:
#write

df.to_csv("new_data.csv")